Revit 2027 API
BuiltInFailures.FabricFailures.CannotPlaceFabricArea Property
 Can't find a host for Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceFabricArea { get; }
Public Shared ReadOnly Property CannotPlaceFabricArea As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceFabricArea {
	FailureDefinitionId^ get ();
}
static member CannotPlaceFabricArea : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace